{"class_name": "Functional", "config": {"name": "model_307", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_40"}, "name": "input_40", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_40", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_61_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_61_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_193_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_193_insert", "inbound_nodes": [[["average_pooling2d_61_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_195_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_195_insert", "inbound_nodes": [[["conv2d_193_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_77_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_77_insert", "inbound_nodes": [[["conv2d_195_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_197_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_197_insert", "inbound_nodes": [[["batch_normalization_77_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_67_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_67_insert", "inbound_nodes": [[["conv2d_197_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_199_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_199_insert", "inbound_nodes": [[["max_pooling2d_67_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_57_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_57_insert", "inbound_nodes": [[["conv2d_199_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_71_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_71_insert", "inbound_nodes": [[["global_average_pooling2d_57_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_72_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_72_insert", "inbound_nodes": [[["custom_expand_layer_71_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_201_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_201_insert", "inbound_nodes": [[["custom_expand_layer_72_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_203_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_203_insert", "inbound_nodes": [[["conv2d_201_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_205_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_205_insert", "inbound_nodes": [[["conv2d_203_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_207_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_207_insert", "inbound_nodes": [[["conv2d_205_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_209_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_209_insert", "inbound_nodes": [[["conv2d_207_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_30", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 5], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_30", "inbound_nodes": [[["conv2d_209_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_79_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_79_insert", "inbound_nodes": [[["custom_pad_layer_30", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_31", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_31", "inbound_nodes": [[["batch_normalization_79_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_18", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 1]]}, "name": "custom_crop_layer_18", "inbound_nodes": [[["custom_pad_layer_31", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_63_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_63_insert", "inbound_nodes": [[["custom_crop_layer_18", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_32", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_32", "inbound_nodes": [[["average_pooling2d_63_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_19", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [1, 2], [0, 0]]}, "name": "custom_crop_layer_19", "inbound_nodes": [[["custom_pad_layer_32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_81_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_81_insert", "inbound_nodes": [[["custom_crop_layer_19", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_33", "trainable": true, "dtype": "float32", "padding": [[0, 1], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_33", "inbound_nodes": [[["batch_normalization_81_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_20", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 3]]}, "name": "custom_crop_layer_20", "inbound_nodes": [[["custom_pad_layer_33", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_65_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_65_insert", "inbound_nodes": [[["custom_crop_layer_20", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_34", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_34", "inbound_nodes": [[["average_pooling2d_65_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_21", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [0, 0], [0, 0]]}, "name": "custom_crop_layer_21", "inbound_nodes": [[["custom_pad_layer_34", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_67_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_67_insert", "inbound_nodes": [[["custom_crop_layer_21", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_35", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_35", "inbound_nodes": [[["average_pooling2d_67_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_22", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 0], [0, 1]]}, "name": "custom_crop_layer_22", "inbound_nodes": [[["custom_pad_layer_35", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_69_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_69_insert", "inbound_nodes": [[["custom_crop_layer_22", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_36", "trainable": true, "dtype": "float32", "padding": [[8, 9], [2, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_36", "inbound_nodes": [[["max_pooling2d_69_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_23", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_23", "inbound_nodes": [[["custom_pad_layer_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_83_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_83_insert", "inbound_nodes": [[["custom_crop_layer_23", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_24", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [2, 2], [2, 2]]}, "name": "custom_crop_layer_24", "inbound_nodes": [[["batch_normalization_83_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_71_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_71_insert", "inbound_nodes": [[["custom_crop_layer_24", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_37", "trainable": true, "dtype": "float32", "padding": [[5, 5], [7, 7], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_37", "inbound_nodes": [[["max_pooling2d_71_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_69_insert_1_merge1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_69_insert_1_merge1", "inbound_nodes": [[["custom_pad_layer_37", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_3_copy_ML", "inbound_nodes": [[["average_pooling2d_69_insert_1_merge1", 0, 0, {}], ["custom_pad_layer_37", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_38", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_38", "inbound_nodes": [[["concatenate_3_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_25", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_25", "inbound_nodes": [[["custom_pad_layer_38", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_73_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_73_insert", "inbound_nodes": [[["custom_crop_layer_25", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_39", "trainable": true, "dtype": "float32", "padding": [[4, 4], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_39", "inbound_nodes": [[["max_pooling2d_73_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_26", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [1, 2]]}, "name": "custom_crop_layer_26", "inbound_nodes": [[["custom_pad_layer_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_85_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_85_insert", "inbound_nodes": [[["custom_crop_layer_26", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_69_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_69_insert_2", "inbound_nodes": [[["max_pooling2d_73_insert", 0, 0, {}]]]}], "input_layers": [["input_40", 0, 0]], "output_layers": [["batch_normalization_85_insert", 0, 0], ["average_pooling2d_69_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}