{"class_name": "Functional", "config": {"name": "model_431", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_53"}, "name": "input_53", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_1", "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_261_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_261_insert", "inbound_nodes": [[["Conv1_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17_insert_1", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_17_insert_1", "inbound_nodes": [[["conv2d_261_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_3_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_3_insert", "inbound_nodes": [[["zero_padding2d_17_insert_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_5_insert", "inbound_nodes": [[["depthwise_conv2d_3_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_81_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_81_insert_1", "inbound_nodes": [[["depthwise_conv2d_5_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_91_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_91_insert", "inbound_nodes": [[["global_average_pooling2d_81_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_92_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_92_insert", "inbound_nodes": [[["custom_expand_layer_91_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_263_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_263_insert", "inbound_nodes": [[["custom_expand_layer_92_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_123_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_123_insert", "inbound_nodes": [[["conv2d_263_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_1_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_1_insert", "inbound_nodes": [[["batch_normalization_123_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_57", "trainable": true, "dtype": "float32", "padding": [[3, 4], [9, 9], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_57", "inbound_nodes": [[["re_lu_1_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_265_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_265_insert", "inbound_nodes": [[["custom_pad_layer_57", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_58", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_58", "inbound_nodes": [[["conv2d_265_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_37", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [7, 7], [0, 0]]}, "name": "custom_crop_layer_37", "inbound_nodes": [[["custom_pad_layer_58", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_267_insert_1", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_267_insert_1", "inbound_nodes": [[["custom_crop_layer_37", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_59", "trainable": true, "dtype": "float32", "padding": [[6, 6], [5, 6], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_59", "inbound_nodes": [[["conv2d_267_insert_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_7_insert_1", "inbound_nodes": [[["custom_pad_layer_59", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_60", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_60", "inbound_nodes": [[["depthwise_conv2d_7_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_38", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [0, 1], [0, 0]]}, "name": "custom_crop_layer_38", "inbound_nodes": [[["custom_pad_layer_60", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_9_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_9_insert", "inbound_nodes": [[["custom_crop_layer_38", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_61", "trainable": true, "dtype": "float32", "padding": [[6, 6], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_61", "inbound_nodes": [[["depthwise_conv2d_9_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_39", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_39", "inbound_nodes": [[["custom_pad_layer_61", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_19_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_19_insert", "inbound_nodes": [[["custom_crop_layer_39", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_40", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 3], [1, 1]]}, "name": "custom_crop_layer_40", "inbound_nodes": [[["zero_padding2d_19_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_125_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_125_insert", "inbound_nodes": [[["custom_crop_layer_40", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_62", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_62", "inbound_nodes": [[["batch_normalization_125_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_41", "trainable": true, "dtype": "float32", "cropping": [[5, 5], [4, 5], [0, 0]]}, "name": "custom_crop_layer_41", "inbound_nodes": [[["custom_pad_layer_62", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_11_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_11_insert", "inbound_nodes": [[["custom_crop_layer_41", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_63", "trainable": true, "dtype": "float32", "padding": [[5, 6], [7, 7], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_63", "inbound_nodes": [[["depthwise_conv2d_11_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3_insert", "inbound_nodes": [[["custom_pad_layer_63", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_42", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [6, 6], [1, 2]]}, "name": "custom_crop_layer_42", "inbound_nodes": [[["re_lu_3_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_21_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_21_insert", "inbound_nodes": [[["custom_crop_layer_42", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_64", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_64", "inbound_nodes": [[["zero_padding2d_21_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_43", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [3, 3]]}, "name": "custom_crop_layer_43", "inbound_nodes": [[["custom_pad_layer_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_127_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_127_insert_1", "inbound_nodes": [[["custom_crop_layer_43", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_65", "trainable": true, "dtype": "float32", "padding": [[4, 4], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_65", "inbound_nodes": [[["batch_normalization_127_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_44", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 4], [0, 0]]}, "name": "custom_crop_layer_44", "inbound_nodes": [[["custom_pad_layer_65", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_5_insert_merge1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_5_insert_merge1", "inbound_nodes": [[["custom_crop_layer_44", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_5_copy_ML", "inbound_nodes": [[["re_lu_5_insert_merge1", 0, 0, {}], ["custom_crop_layer_44", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_66", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_66", "inbound_nodes": [[["add_5_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_45", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 0], [1, 1]]}, "name": "custom_crop_layer_45", "inbound_nodes": [[["custom_pad_layer_66", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_23_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_23_insert", "inbound_nodes": [[["custom_crop_layer_45", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_67", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_67", "inbound_nodes": [[["zero_padding2d_23_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_46", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [7, 7], [1, 1]]}, "name": "custom_crop_layer_46", "inbound_nodes": [[["custom_pad_layer_67", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_7_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_7_insert", "inbound_nodes": [[["custom_crop_layer_46", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_68", "trainable": true, "dtype": "float32", "padding": [[2, 2], [7, 7], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_68", "inbound_nodes": [[["re_lu_7_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_129_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_129_insert", "inbound_nodes": [[["custom_pad_layer_68", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_69", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_69", "inbound_nodes": [[["batch_normalization_129_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_47", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [6, 7], [0, 0]]}, "name": "custom_crop_layer_47", "inbound_nodes": [[["custom_pad_layer_69", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_9_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_9_insert", "inbound_nodes": [[["custom_crop_layer_47", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_70", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_70", "inbound_nodes": [[["re_lu_9_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_48", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 0], [3, 3]]}, "name": "custom_crop_layer_48", "inbound_nodes": [[["custom_pad_layer_70", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_127_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_127_insert_2", "inbound_nodes": [[["depthwise_conv2d_5_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_131_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_131_insert", "inbound_nodes": [[["custom_crop_layer_48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv1_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_2", "inbound_nodes": [[["re_lu_3_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_4", "trainable": true, "dtype": "float32", "cropping": [[23, 23], [23, 23]], "data_format": "channels_last"}, "name": "cropping2d_4", "inbound_nodes": [[["batch_normalization_127_insert_2", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_7_insert_2", "inbound_nodes": [[["re_lu_7_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_267_insert_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_267_insert_2", "inbound_nodes": [[["batch_normalization_129_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17_insert_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_17_insert_2", "inbound_nodes": [[["re_lu_1_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_81_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_81_insert_2", "inbound_nodes": [[["re_lu_1_insert", 0, 0, {}]]]}], "input_layers": [["input_53", 0, 0]], "output_layers": [["batch_normalization_131_insert", 0, 0], ["Conv1_2", 0, 0], ["cropping2d_4", 0, 0], ["depthwise_conv2d_7_insert_2", 0, 0], ["conv2d_267_insert_2", 0, 0], ["zero_padding2d_17_insert_2", 0, 0], ["global_average_pooling2d_81_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}