{"class_name": "Functional", "config": {"name": "model_339", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_43"}, "name": "input_43", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_43", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_225_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_225_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_79_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_79_insert_1", "inbound_nodes": [[["conv2d_225_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_227_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_227_insert", "inbound_nodes": [[["max_pooling2d_79_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_229_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_229_insert", "inbound_nodes": [[["conv2d_227_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_91_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_91_insert", "inbound_nodes": [[["conv2d_229_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_231_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_231_insert", "inbound_nodes": [[["batch_normalization_91_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_63_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_63_insert", "inbound_nodes": [[["conv2d_231_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_77_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_77_insert", "inbound_nodes": [[["global_average_pooling2d_63_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_78_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_78_insert", "inbound_nodes": [[["custom_expand_layer_77_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_13_insert", "inbound_nodes": [[["custom_expand_layer_78_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_40", "trainable": true, "dtype": "float32", "padding": [[7, 8], [3, 4], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_40", "inbound_nodes": [[["zero_padding2d_13_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_93_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_93_insert_merge1", "inbound_nodes": [[["custom_pad_layer_40", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_1_copy_ML", "inbound_nodes": [[["batch_normalization_93_insert_merge1", 0, 0, {}], ["custom_pad_layer_40", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_41", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 2], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_41", "inbound_nodes": [[["add_1_copy_ML", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_95_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_95_insert", "inbound_nodes": [[["custom_pad_layer_41", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_27", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [0, 0], [2, 3]]}, "name": "custom_crop_layer_27", "inbound_nodes": [[["batch_normalization_95_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_97_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_97_insert", "inbound_nodes": [[["custom_crop_layer_27", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_42", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_42", "inbound_nodes": [[["batch_normalization_97_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_28", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [3, 4], [0, 0]]}, "name": "custom_crop_layer_28", "inbound_nodes": [[["custom_pad_layer_42", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_233_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_233_insert", "inbound_nodes": [[["custom_crop_layer_28", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_43", "trainable": true, "dtype": "float32", "padding": [[7, 7], [4, 5], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_43", "inbound_nodes": [[["conv2d_233_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_99_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_99_insert", "inbound_nodes": [[["custom_pad_layer_43", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_44", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_44", "inbound_nodes": [[["batch_normalization_99_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_29", "trainable": true, "dtype": "float32", "cropping": [[6, 6], [0, 1], [0, 0]]}, "name": "custom_crop_layer_29", "inbound_nodes": [[["custom_pad_layer_44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_235_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_235_insert", "inbound_nodes": [[["custom_crop_layer_29", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_79_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_79_insert_2", "inbound_nodes": [[["zero_padding2d_13_insert", 0, 0, {}]]]}], "input_layers": [["input_43", 0, 0]], "output_layers": [["conv2d_235_insert", 0, 0], ["max_pooling2d_79_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}