{"class_name": "Functional", "config": {"name": "model_268", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_37"}, "name": "input_37", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_37", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_55_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_55_insert_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_65_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_65_insert", "inbound_nodes": [[["average_pooling2d_55_insert_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_55_insert", "inbound_nodes": [[["batch_normalization_65_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_163_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_163_insert", "inbound_nodes": [[["max_pooling2d_55_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_165_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_165_insert", "inbound_nodes": [[["conv2d_163_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_51_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_51_insert", "inbound_nodes": [[["conv2d_165_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_65_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_65_insert", "inbound_nodes": [[["global_average_pooling2d_51_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_66_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_66_insert", "inbound_nodes": [[["custom_expand_layer_65_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_167_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_167_insert", "inbound_nodes": [[["custom_expand_layer_66_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_169_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_169_insert", "inbound_nodes": [[["conv2d_167_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_171_insert_1", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_171_insert_1", "inbound_nodes": [[["conv2d_169_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_173_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_173_insert", "inbound_nodes": [[["conv2d_171_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_175_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_175_insert", "inbound_nodes": [[["conv2d_173_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_177_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_177_insert", "inbound_nodes": [[["conv2d_175_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_179_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_179_insert", "inbound_nodes": [[["conv2d_177_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_181_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_181_insert", "inbound_nodes": [[["conv2d_179_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_24", "trainable": true, "dtype": "float32", "padding": [[3, 4], [6, 6], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_24", "inbound_nodes": [[["conv2d_181_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_57_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_57_insert", "inbound_nodes": [[["custom_pad_layer_24", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_25", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 1], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_25", "inbound_nodes": [[["max_pooling2d_57_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_67_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_67_insert_1", "inbound_nodes": [[["custom_pad_layer_25", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_26", "trainable": true, "dtype": "float32", "padding": [[1, 1], [2, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_26", "inbound_nodes": [[["batch_normalization_67_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_14", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_14", "inbound_nodes": [[["custom_pad_layer_26", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_59_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_59_insert", "inbound_nodes": [[["custom_crop_layer_14", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_27", "trainable": true, "dtype": "float32", "padding": [[6, 7], [2, 2], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_27", "inbound_nodes": [[["max_pooling2d_59_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_61_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_61_insert", "inbound_nodes": [[["custom_pad_layer_27", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_28", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_28", "inbound_nodes": [[["max_pooling2d_61_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_15", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [5, 6]]}, "name": "custom_crop_layer_15", "inbound_nodes": [[["custom_pad_layer_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_69_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_69_insert", "inbound_nodes": [[["custom_crop_layer_15", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_29", "trainable": true, "dtype": "float32", "padding": [[5, 5], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_29", "inbound_nodes": [[["batch_normalization_69_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_16", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 3], [0, 0]]}, "name": "custom_crop_layer_16", "inbound_nodes": [[["custom_pad_layer_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_71_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_71_insert", "inbound_nodes": [[["custom_crop_layer_16", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_17", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 1], [1, 2]]}, "name": "custom_crop_layer_17", "inbound_nodes": [[["batch_normalization_71_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_171_insert_2", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_171_insert_2", "inbound_nodes": [[["average_pooling2d_55_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_67_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_67_insert_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_55_insert_2_merge1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_55_insert_2_merge1", "inbound_nodes": [[["max_pooling2d_57_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_73_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_73_insert", "inbound_nodes": [[["custom_crop_layer_17", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_2", "trainable": true, "dtype": "float32", "cropping": [[69, 69], [69, 69]], "data_format": "channels_last"}, "name": "cropping2d_2", "inbound_nodes": [[["conv2d_171_insert_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_3", "trainable": true, "dtype": "float32", "cropping": [[69, 69], [69, 69]], "data_format": "channels_last"}, "name": "cropping2d_3", "inbound_nodes": [[["batch_normalization_67_insert_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_2_copy_ML", "inbound_nodes": [[["average_pooling2d_55_insert_2_merge1", 0, 0, {}], ["max_pooling2d_57_insert", 0, 0, {}]]]}], "input_layers": [["input_37", 0, 0]], "output_layers": [["batch_normalization_73_insert", 0, 0], ["cropping2d_2", 0, 0], ["cropping2d_3", 0, 0], ["concatenate_2_copy_ML", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}