{"class_name": "Functional", "config": {"name": "model_66", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_7_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_7_insert", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_19_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_19_insert", "inbound_nodes": [[["average_pooling2d_7_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_9_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_9_insert_1", "inbound_nodes": [[["conv2d_19_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_25_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_25_insert", "inbound_nodes": [[["flatten_9_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_19", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_19", "inbound_nodes": [[["dropout_25_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_20", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_20", "inbound_nodes": [[["custom_expand_layer_19", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_6", "trainable": true, "dtype": "float32", "padding": [[5, 6], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_6", "inbound_nodes": [[["custom_expand_layer_20", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_4", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [396, 396]]}, "name": "custom_crop_layer_4", "inbound_nodes": [[["custom_pad_layer_6", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_9_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_9_insert", "inbound_nodes": [[["custom_crop_layer_4", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_9_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_9_insert_2", "inbound_nodes": [[["average_pooling2d_9_insert", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["average_pooling2d_9_insert", 0, 0], ["flatten_9_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}